# 아이디어
## 점점 한 단계 부모 노드로 올라가는 것과 같다. 
## 따라서 이진트리에서 부모 노드를 계산해주는 방식으로 본인의 인덱스를 업데이트하고, 두 노드의 값이 같아지면 끝난다. 
## 이때 한 단계 올라갈 때마다 count+=1 을 해준다.

# 예상 시간복잡도
## 2의 20제곱이 최대인데 절반씩으로 줄기 때문에 최대 20번 연산한다.

# 풀이시간 
## 25분

# 실행시간 
## 0ms~ 0.01ms

def solution(n,a,b):
    answer = 0
    x = min(a,b)
    y = max(a,b)
    
    while (y-x) > 0 :
        if x %2 == 0 :
            x //= 2
            
        else :
            x += 1
            x //= 2 
        
        if y%2 == 0 :
            y //=2 
            
        else :
            y += 1
            y //= 2 
            
        answer += 1

    return answer